Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_partnerships/civil_partnership_and_inheritance.html.txt.tmx
Source language: en
Languages: ga

source: Civil partnership and inheritance
ga: Páirtnéireacht shibhialta agus oidhreachtúlacht

source: Your civil status affects your rights to inherit from your spouse/partner
ga: Téann do stádas sibhialta i bhfeidhm ar do chearta oidhreachtúlachta ó do chéile/pháirtnéir

source: Civil partners have the same legal right to inherit as spouses and the same rights on intestacy
ga: Tá an ceart dlíthiúil céanna ag páirtnéireachtaí sibhialta teacht in oidhreacht agus atá ag céilí agus na cearta céanna ar dhíthiomnacht

source: A will is automatically revoked when you register a civil partnership unless it was made in contemplation of that registration
ga: Cúlghairtear uacht uaidh féin nuair a chláraíonn tú páirtnéireacht shibhialta mura ndearnadh é i rinnfheitheamh ar an gclárú sin

source: A bequest in a will to a person who is a witness to the will or to that person’s civil partner is void
ga: Tá tiomnacht in uacht do dhuine ar fianaise é don uacht nó do pháirtnéir shibhialta an duine sin curtha ar neamhní

source: If you are not in a civil partnership, you may only inherit from your partner if you are left a bequest in a valid will
ga: Mura bhfuil tú i bpáirtnéireacht shibhialta, féadfaidh tú teacht in oidhreacht ó do pháirtnéir má fhágtar tiomnacht agat in uacht bhailí amháin

source: However, a civil partner is entitled to what is called a "legal right share" of their deceased civil partner's estate even if:
ga: Tá páirtnéir shibhialta i dteideal ar a dtugtar ‘cuid cheart dhlíthiúil’ d’eastát a bpáirtnéir shibhialta nach maireann, áfach, fiú:

source: • there is no will
ga: • Mura bhfuil aon uacht

source: • the will is invalid
ga: • Má tá an uacht neamhbhailí

source: • there is a valid will, but it leaves little or nothing to the surviving civil partner
ga: • Má tá uacht bhailí ann, ach nch bhfágann sí ach beagán nó rud ar bith don pháirtnéir sibhialta marthanaigh

source: The civil status of the deceased person may also indirectly affect the inheritance rights of his/her children
ga: D’fhéadfaí go dtiocfadh stádas sibhialta an duine nach maireann ar chearta oidhreachtúlachta a leanaí go neamhdhíreach chomh maith

source: Civil Partner's inheritance rights
ga: Cearta oidhreachtúlachta an pháirtnéir sibhialta

source: The amount of the surviving civil partner's legal right share depends on two factors:
ga: Braitheann méid an chuid cheart dhlíthiúil an pháirtnéir sibhialta marthanaigh ar dhá fhachtóir:

source: • whether or not there is a valid will
ga: • Má tá uacht bhailí ann nó mura bhfuil

source: • whether or not the deceased civil partner has any children
ga: • Má tá leanaí ag an bpáirtnéir sibhialta nach maireann nó mura bhfuil

source: You are entitled to the whole estate if:
ga: Tá tú i dteideal an éastáit iomláin:

source: • there is no will or the will is invalid, and
ga: • Mura bhfuil aon uacht ann nó tá an uacht neamhbhailí, agus

source: • the deceased civil partner has no children or grandchildren
ga: • Mura bhfuil aon leanaí nó garleanaí ag an bpáirtnéir sibhialta nach maireann

source: You are entitled to two-thirds of the estate if:
ga: Tá tú i dteideal dhá thrian den eastát:

source: • there is no valid will, and
ga: • Mura bhfuil aon uacht bhailí ann, agus

source: • the deceased civil partner has children or grandchildren
ga: • Má tá leanaí nó garleanaí ag an bpáirtnéir sibhialta nach maireann

source: You are entitled to one-half of the estate if:
ga: Tá tú i dteideal aon leath den eastát:

source: • there is a valid will, and
ga: • Má tá uacht bhailí ann agus

source: You are entitled to one-third of the estate if:
ga: Tá tú i dteideal aon trian den eastát:

source: If you are the surviving civil partner, you must be informed of this right and should apply for your legal right share as soon as possible
ga: Más tú an páirtnéir sibhialta marthanaigh, caithfear tú a chur ar an eolas faoin gceart seo agus ba cheart duit cur isteach ar do chuid cheart dhlíthiúil a luaithe agus is féidir

source: You may require that the shared home be given to you in satisfaction of your legal right share, even if the home was left to another person under the will
ga: D’fhéadfaí go dteastódh uait an comhtheach a bheith tugtha duit mar shásamh ar do chuid cheart dhlíthiúil, fiú má fágadh an teach ag duine eile faoin uacht

source: If the shared home is worth more than the legal right share, you will normally have to pay the difference into the deceased's estate
ga: Más tá fiúchas an tí níos mó ná an chuid cheart dhlíthiúil, beidh ort an difríocht a íoc isteach in eastát an duine nach maireann go hiondúil

source: However, in cases of hardship, you may apply to the court to have the dwelling house given to you either without paying the difference or by paying such sum as the court thinks reasonable
ga: I gcásanna cruatain, áfach, féadfaidh tú cur isteach chuig an gcúirt go dtabharfaí an teach cónaithe duitse gan an difríocht a íoc nó suim a íoc atá réasúnta, mar a shíleann an chúirt

source: Children have a right to inherit from their biological parents
ga: Tá ceart ag leanaí teacht in oidhreacht óna dtuismitheoirí fola

source: As the surviving civil partner's children are not the biological children of the deceased, they do not have a right to inherit from the deceased civil partner
ga: Mar nach iad leanaí an pháirtnéir sibhialta marthanaigh leanaí fola an duine nach maireann, níl aon cheart acu teacht in oidhreacht ón bpáirtnéir sibhialta nach maireann

source: Children's inheritance rights may be affected by their deceased parent's civil status
ga: D’fhéadfaí go gcuirfeadh stádas sibhialta an tuismitheora nach maireann isteach ar chearta oidhreachtúla leanaí

source: The children (minor and adult) are entitled to the entire estate divided equally between them if:
ga: Tá na leanaí (mionaoiseach agus aosach) i dteideal an eastáit iomlán a bheith roinnte go comhionann eatarthu:

source: • the deceased parent is not in a civil partnership or his/her civil partner is already dead
ga: • Mura bhfuil tuismitheoir nach maireann i bpáirtnéireacht shibhialta nó tá a p(h)áirtnéir sibhialta básaithe cheana

source: But the children are only entitled to one-third of the estate divided equally between them if:
ga: Níl na leanaí i dteideal aon trian den eastát roinnte go comhionann eatarthu ach amháin:

source: • there is no valid will or the will is invalid, and
ga: • Mura bhfuil aon uacht ann nó tá an uacht neamhbhailí, agus

source: • the deceased parent is in a civil partnership and is survived by his/her civil partner
ga: • Má tá an tusimitheoir nach maireann i bpáirtnéireacht shibhialta agus tá sé ar marthain i ndiaidh a p(h)áirtnéir shibhialta

source: Children have no absolute right to inherit their parent's estate if the deceased parent has made a valid will
ga: Níl aon dhearbhcheart ag leanaí teacht in oidhreacht ar eastát a dtuismitheora má tá uacht bhailí déanta ag an tuismitheoir nach maireann

source: However, if a child considers that he/she has not been adequately provided for, he/she may make an application to court
ga: Má cheapann an leanbh nach bhfuil soláthar imleor déanta dó/di, áfach, féadfaidh sé/sí iarratas a chur isteach chuig an gcúirt

source: The child need not be a minor or be dependent in order to use this procedure
ga: Ní gá don leanbh a bheith ina mhionaoiseach nó ina chleithiúnach chun úsáid a bhaint as an nós imeachta seo

source: The court has to decide if the parent has "failed in his moral duty to make proper provision for the child in accordance with his means"
ga: Caithfidh an chúirt a chinneadh má “theip ar an tuismitheoir soláthar ceart a dhéanamh don leanbh de réir a chuid acmhainní”

source: Each case is decided on its merits and the court looks at the situation from the point of view of a "prudent and just" parent
ga: Cinntear gach cás ar a thuillteanais agus féachann an chúirt ar an gcás ó thaobh “tuismitheoir stuama agus ceart”

source: Should the court order that some provision be made for a child or children from the estate of the deceased, such an order can reduce the entitlement of the surviving civil partner to a legal right share
ga: Má dhéanann an chúirt ordú go gcaithfear soláthar éigin a dhéanamh do leanbh nó leanaí ó eastát an duine nach maireann, is féidir lena leithéid d’ordú teidlíocht an pháirtnéir shibhialta ar marthain a laghdú chuig cuid cheart dhlíthiúil

source: Anyone considering challenging a will on these grounds should get legal opinion before applying to the court
ga: Ba cheart d’aon duine atá ag meas dushlán a thabhairt d’uacht ar na forais seo tuairim dhlíthiúil a fháil roimh chur isteach chuig an gcúirt

source: Marital status and inheritance rights
ga: Stádas pósta agus cearta oidhreachtúla

source: You can find information on how marriage affects inheritance in our document on marital status and inheritance
ga: Is féidir leat eolas a fháil ar an gcaoi a théann pósadh i bhfeidhm ar chearta oidhreachtúla inár gcáipéis ar stádas pósta agus oidhreachtúlacht
